; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v11 ?v9)
             (pred_2 ?v5 ?v2)
             (pred_5 ?v11 ?v2)
             (pred_7 ?v3 ?v11 )
	     (pred_12 ?v11)
             (pred_9 ?v8)
             (pred_10 ?v5)
             (pred_3 ?v2)
             (pred_11 ?v11)
             (pred_4 ?v5)
             (pred_6 ?v11)
             (pred_1 ))



(:action op_1
:parameters (?v4 ?v10 ?v12 ?v7)
:precondition (and (pred_9 ?v4) (pred_9 ?v10) (pred_10 ?v12) (pred_3 ?v7)
          (pred_8 ?v4 ?v10) (pred_2 ?v12 ?v7)
                   (pred_5 ?v10 ?v7) (pred_12 ?v4) 
                   (pred_11 ?v10) (pred_4 ?v12))
:effect (and  (pred_6 ?v10) (not (pred_11 ?v10))))


(:action op_5
:parameters (?v4 ?v6)
:precondition (and (pred_9 ?v4) (pred_9 ?v6)
               (pred_12 ?v4) (pred_8 ?v4 ?v6) (pred_6 ?v6))
:effect (and (pred_12 ?v6) (not (pred_12 ?v4))))

(:action op_3
:parameters (?v4 ?v12)
:precondition (and (pred_9 ?v4) (pred_10 ?v12) 
                  (pred_12 ?v4) (pred_7 ?v12 ?v4) (pred_1 ))
:effect (and (pred_4 ?v12)
   (not (pred_7 ?v12 ?v4)) (not (pred_1 ))))


(:action op_2
:parameters (?v4 ?v1 ?v13)
:precondition (and (pred_9 ?v4) (pred_10 ?v1) (pred_10 ?v13)
                  (pred_12 ?v4) (pred_4 ?v13) (pred_7 ?v1 ?v4))
:effect (and (pred_4 ?v1) (pred_7 ?v13 ?v4)
        (not (pred_4 ?v13)) (not (pred_7 ?v1 ?v4))))

(:action op_4
:parameters (?v4 ?v12)
:precondition (and (pred_9 ?v4) (pred_10 ?v12) 
                  (pred_12 ?v4) (pred_4 ?v12))
:effect (and (pred_1 ) (pred_7 ?v12 ?v4) (not (pred_4 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_16 obj_01 obj_10 obj_11 obj_03 obj_21 obj_14 obj_04 obj_02 obj_13 obj_07 obj_17 obj_09 obj_08 obj_18
    obj_06 obj_15
    obj_19 obj_20 obj_05
    )

    (:init
       (pred_1)

       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_01)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_04)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_07)
       (pred_9 obj_17)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_05)

       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_16 obj_03)
       (pred_8 obj_16 obj_01)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_01 obj_21)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_16)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_21 obj_13)
       (pred_8 obj_21 obj_14)
       (pred_8 obj_21 obj_01)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_21)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_02 obj_09)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_13 obj_21)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_17 obj_04)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_02)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_08 obj_18)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_08)
       (pred_11 obj_12)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_5  obj_12 obj_06)
       (pred_5  obj_18 obj_15)
       (pred_5  obj_13 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_17)
       (pred_6 obj_09)
       (pred_6 obj_08)

       (pred_2  obj_19 obj_06)
       (pred_2  obj_20 obj_15)
       (pred_2  obj_05 obj_15)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_05 obj_01)
       (pred_12 obj_17)
    )

    (:goal (and
       (pred_7 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_12 obj_16)))
)
)

; plan
1. (op_5 obj_17 obj_09)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_09)
   goals met: 0 of 1
2. (op_3 obj_09 obj_20)
   deleted: (pred_7 obj_20 obj_09) (pred_1)
   added: (pred_4 obj_20)
   goals met: 0 of 1
3. (op_5 obj_09 obj_02)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_02)
   goals met: 0 of 1
4. (op_5 obj_02 obj_03)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_03)
   goals met: 0 of 1
5. (op_5 obj_03 obj_21)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_21)
   goals met: 0 of 1
6. (op_5 obj_21 obj_01)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_01)
   goals met: 0 of 1
7. (op_2 obj_01 obj_05 obj_20)
   deleted: (pred_4 obj_20) (pred_7 obj_05 obj_01)
   added: (pred_4 obj_05) (pred_7 obj_20 obj_01)
   goals met: 0 of 1
8. (op_5 obj_01 obj_21)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_21)
   goals met: 0 of 1
9. (op_5 obj_21 obj_03)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_03)
   goals met: 0 of 1
10. (op_5 obj_03 obj_11)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_11)
   goals met: 0 of 1
11. (op_4 obj_11 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_1) (pred_7 obj_05 obj_11)
   goals met: 1 of 1
